In [1]:
import pandas as pd

In [10]:
rating_csv = 'dataset/ratings.csv'
movies_csv = 'dataset/movies.csv'

# Preprocessing

In [29]:
ratings_df = pd.read_csv(rating_csv)
ratings_df.head(10)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931
5       1       70     3.0  964982400
6       1      101     5.0  964980868
7       1      110     4.0  964982176
8       1      151     5.0  964984041
9       1      157     5.0  964984100

In [30]:
movies_df = pd.read_csv(movies_csv)
movies_df.head(10)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

## Cleaning

In [31]:
ratings_df = ratings_df.drop(labels=['timestamp'], axis=1)

In [32]:
ratings_df.head(100)

    userId  movieId  rating
0        1        1     4.0
1        1        3     4.0
2        1        6     4.0
3        1       47     5.0
4        1       50     5.0
..     ...      ...     ...
95       1     1445     3.0
96       1     1473     4.0
97       1     1500     4.0
98       1     1517     5.0
99       1     1552     4.0

[100 rows x 3 columns]

## Transactional dataset

In [33]:
ratings_df = ratings_df[ratings_df['rating'] > 2]

In [34]:
ratings_df.head(100)

     userId  movieId  rating
0         1        1     4.0
1         1        3     4.0
2         1        6     4.0
3         1       47     5.0
4         1       50     5.0
..      ...      ...     ...
96        1     1473     4.0
97        1     1500     4.0
98        1     1517     5.0
99        1     1552     4.0
100       1     1573     5.0

[100 rows x 3 columns]

In [41]:
user_counts = pd.DataFrame(ratings_df['userId'].value_counts().sort_values())
user_counts

        count
userId
442         2
508         6
293        10
329        11
431        13
...       ...
610      1233
448      1255
599      1794
474      1853
414      2239

[610 rows x 1 columns]

In [44]:
active_users = user_counts[user_counts['count'] > 10].index
ratings_df = ratings_df[ratings_df['userId'].isin(active_users)]

In [45]:
ratings_df

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100831     610   166534     4.0
100832     610   168248     5.0
100833     610   168250     5.0
100834     610   168252     5.0
100835     610   170875     3.0

[87295 rows x 3 columns]

In [50]:
transactions = (ratings_df
                 .groupby('userId')['movieId']
                 .apply(lambda x: (set(x), len(x)))
                 .reset_index())

transactions[['movies', 'count']] = pd.DataFrame(transactions['movieId'].tolist(), index=transactions.index)
transactions.drop(columns=['movieId'], inplace=True)

transactions

     userId                                             movies  count
0         1  {1024, 1, 1025, 3, 2048, 1029, 6, 1030, 1031, ...    226
1         2  {115713, 122882, 48516, 91529, 80906, 91658, 1...     28
2         3  {70946, 2851, 5764, 4518, 26409, 7991, 1275, 2...     18
3         4  {1025, 3079, 3083, 21, 1046, 2583, 4121, 538, ...    167
4         5  {1, 515, 261, 265, 527, 531, 21, 150, 534, 153...     40
..      ...                                                ...    ...
602     606  {1, 8195, 6148, 7, 11, 69644, 4109, 15, 17, 18...   1070
603     607  {1, 517, 2053, 2054, 1544, 3081, 11, 1036, 257...    174
604     608  {1, 4105, 10, 6157, 16, 21, 31, 32, 2080, 34, ...    670
605     609  {1, 137, 10, 650, 1161, 786, 150, 288, 161, 10...     37
606     610  {1, 122882, 122884, 6, 122886, 81932, 73741, 1...   1233

[607 rows x 3 columns]

In [51]:
transactions.to_csv('transaction_dataset.csv', header=True)

In [54]:
transactions = pd.read_csv('transaction_dataset.csv')
transactions.head(10)

,Unnamed: 0,userId,movies,count
0,0,1,"{1024, 1, 1025, 3, 2048, 1029, 6, 1030, 1031, ...",226
1,1,2,"{115713, 122882, 48516, 91529, 80906, 91658, 1...",28
2,2,3,"{70946, 2851, 5764, 4518, 26409, 7991, 1275, 2...",18
3,3,4,"{1025, 3079, 3083, 21, 1046, 2583, 4121, 538, ...",167
4,4,5,"{1, 515, 261, 265, 527, 531, 21, 150, 534, 153...",40
5,5,6,"{2, 3, 4, 5, 6, 7, 8, 515, 10, 11, 516, 13, 52...",294
6,6,7,"{1, 8207, 34319, 42002, 3114, 1584, 50, 58, 16...",111
7,7,8,"{2, 11, 141, 527, 21, 150, 282, 539, 32, 34, 2...",43
8,8,9,"{3328, 4993, 5378, 5890, 5893, 1674, 5902, 373...",34
9,9,10,"{7169, 33794, 6155, 54286, 72720, 86548, 30749...",119